import numpy as np
import matplotlib.pyplot as plt

# 10x10のダミーデータ作成
a = [68.16,69.76,71.47,74.87,74.07]
b = [74.53,75,75.92,73.86,75.17]
c = [73.02 ,73.59,74.17,74.25,73.78]
d = [72.11,72.87,74.97,73.15, 71.63]
e = [73.04,73.35,73.23,74.97,74.31]

result = [a,b,c,d,e]

# ヒートマップ表示
plt.figure()
plt.imshow(result,interpolation='nearest',vmin=68.16,vmax=75,cmap='jet')
plt.colorbar()
plt.show()

200[68.59,68.69,70.03,77.66,79.22]
400[68.73,68.39,68.16,71.09,ooo]
600[71.0,69.61,69.39,70.00,72.36]
800[68.51,69.54,69.91,70.66,71.23]
1000[69.91,69.59,70.16,69.71]